snlkuharlocal/src/Documents/УстановкаЗаместителейРуководителя/УстановкаЗаместителейРуководителя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЗаместителейРуководителя</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Заместитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтгружатьСПросроченнойЗадолженностью</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгружатьСПревышениемЛимита</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/ЗаместителиРуководителей/ЗаместителиРуководителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаместителиРуководителей</name>
  <resources>
    <name>Дата1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтгружатьСПросроченнойЗадолженностью</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтгружатьСПревышениемЛимита</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заместитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>документ</name>
    <type>
      <types>DocumentRef.УстановкаЗаместителейРуководителя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/УстановкаЗаместителейРуководителя/ObjectModule.bsl
Перем НадоПерезаписыватьСкидки;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	НадоПерезаписыватьСкидки	= Ложь;
	ЕстьИзменения				= Модифицированность();
	
	Если НЕ ОбменДанными.Загрузка Тогда
		//КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;	
	
	Если НЕ ЕстьИзменения Тогда Возврат КонецЕсли;
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	
	Если проведен=Истина тогда
		НаборЗаписей		=РегистрыСведений.ЗаместителиРуководителей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(ссылка);
		
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		
		нов=наборзаписей.Добавить();
		нов.руководитель=руководитель;
		нов.Дата1=дата1;
		нов.Дата2=дата2;
		нов.документ=ссылка;
		нов.Заместитель=заместитель;
		Нов.ОтгружатьСПревышениемЛимита=ОтгружатьСПревышениемЛимита;
		нов.ОтгружатьСПросроченнойЗадолженностью=ОтгружатьСПросроченнойЗадолженностью;
		нов.Автор =автор;
		
		НаборЗаписей.записать();
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.	
	
	НаборЗаписей		=РегистрыСведений.ЗаместителиРуководителей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(ссылка);
	
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	наборзаписей.Записать();	
	
КонецПроцедуры
